000100160919     FMARKSDSP  CF   E             WORKSTN
000101160919      /FREE
000102160919          EXFMT RECORD1;
000103160919                  DOW NOT(*IN03);
000104160919                    EXSR  GETGRADE;
000105160919                    WRITE RECORD1;
000106160919                    EXFMT RECORD2;
000107160919                    IF *IN03 = *OFF;
000108160919                       EXSR CLEARMARKS;
000109160919                       EXFMT RECORD1;
000110160919                    ENDIF;
000111160919                  ENDDO;
000112160919                  *INLR = *ON;
000113160919          RETURN;
000114160919
000115160919          BEGSR GETGRADE;
000116160919	         LETGRADE = 'F';
000117160919	         TESTOVRALL = (TEST1 + TEST2 + TEST3) / 3;
000118160919	         NUMGRADE = (TESTOVRALL * 0.35) + LABS + (EXAM * 0.35);
000119160919
000120160919              SELECT;
000121160919                WHEN NUMGRADE >= 90;
000122160919                  EVAL LETGRADE = 'A+';
000123160919                WHEN NUMGRADE >= 80;
000124160919                  EVAL LETGRADE = 'A';
000125160919                WHEN NUMGRADE >= 75;
000126160919                  EVAL LETGRADE = 'B+';
000127160919                WHEN NUMGRADE >= 70;
000128160919                  EVAL LETGRADE = 'B';
000129160919                WHEN NUMGRADE >= 65;
000130160919                  EVAL LETGRADE = 'C+';
000131160919                WHEN NUMGRADE >= 60;
000132160919                  EVAL LETGRADE = 'C';
000133160919                WHEN NUMGRADE >= 55;
000134160919                  EVAL LETGRADE = 'D+';
000135160919                WHEN NUMGRADE >= 50;
000136160919                  EVAL LETGRADE = 'D';
000137160919                WHEN NUMGRADE <=49;
000138160919                  EVAL LETGRADE = 'F';
000140160919              ENDSL;
000141160919          ENDSR;
000142160919
000143160919          BEGSR CLEARMARKS;
000144160919            TEST1 = 0;
000145160919            TEST2 = 0;
000146160919            TEST3 = 0;
000147160919            LABS = 0;
000148160919            EXAM = 0;
000149160919          ENDSR;
000150160919
000151160919
000152160919
