000100161112     FSTUDENTDF CF   E             WORKSTN
000101161112     FSTUDENTS  IF   E             DISK
000102161112      /FREE
000103161112          READ STUDENTS;
000104161114          DOW (NOT %EOF) AND (*IN03 = *OFF);
000107161112            TSTUDENT = TSTUDENT + 1;
000108161112
000109161112            IF FINEOWED > 0;
000110161114              TFINEOWED = TFINEOWED + FINEOWED;
000113161112            ENDIF;
000114161112
000115161112            IF FEESOWED > 0;
000116161114              TFEEOWED = TFEEOWED + FEESOWED;
000119161112            ENDIF;
000120161114
000121161112            FULLNAME = %TrimR(FIRSTNAME) + ' ' + LASTNAME;
000126161114
000127161112            EXFMT RECORD1;
000128161112            READ STUDENTS;
000129161112          ENDDO;
000130161112          TOTALOWED = TFEEOWED + TFINEOWED;
000131161112          EXFMT RECORD2;
000132161112          *INLR = *ON;
000133161112
000134161112          RETURN;
000135161112      /END-FREE
000136161112
