000100161017     A          R STUDENTSR                 PFILE(STUDENTS)
000101161017     A          K LASTNAME
000102161017     A          S FEESOWED                  COMP(GT 0 )
000103161017
