000100161017     A          R MARKSR
000101161011     A            STUDENTID      9P 0       COLHDG('STUDENT' 'ID')
000103161011     A                                      EDTWRD('0   -   -   ')
000104161017     A            COURSE_CD      6          COLHDG('COURSE' 'CODE')
000105161017     A            FINAL_MARK     3P 0       COLHDG('FINAL' 'MARK')
000106161011     A            DATERUN         L         COLHDG('DATE' 'RUN')
