000001160919     A          R RECORD1
000002160919     A                                  2 31'Marks Calculator'
000100160919     A                                  2  4USER
000101160919     A                                  3  4SYSNAME
000102160919     A                                  2 65DATE
000103160919     A                                  3 65TIME
000104160919     A                                  5 32'Test1:'
000105160919     A                                  6 32'Test2:'
000106160919     A                                  7 32'Test3:'
000107160919     A                                  8 32'Labs:'
000108160919     A                                  9 32'Exam:'
000109160919     A            TEST1          3  0B  5 40RANGE(0 100)
000110160919     A            TEST2          3  0B  6 40RANGE(0 100)
000111160919     A            TEST3          3  0B  7 40RANGE(0 100)
000112160919     A            LABS           2  0B  8 40RANGE(0 30)
000113160919     A            EXAM           3  0B  9 40RANGE(0 100)
000115160919     A          R RECORD2                   OVERLAY
000116160919     A                                      CA03(03 'EXIT')
000117160919     A                                 10 32'Tests:'
000118160919     A                                 11 32'Final Mark:'
000119160919     A                                 12 32'Final Grade:'
000120160919     A                                 14 12'F3 - Exit'
000121160919     A            TEST1          3  0O 10 45RANGE(0 100)
000122160919     A            TEST2          2   O 12 45RANGE(0 100)
000123160919     A            TEST3          3  0O 11 45RANGE(0 100)
